In [8]:
import sqlite3

In [9]:
# Create connection
conn = sqlite3.connect('school.db')
cursor = conn.cursor()

In [11]:
# Create tables
cursor.execute('''CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    age INTEGER,
    gender TEXT
)''')

cursor.execute('''CREATE TABLE IF NOT EXISTS courses (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    credits INTEGER
)''')

cursor.execute('''CREATE TABLE IF NOT EXISTS enrollments (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    student_id INTEGER,
    course_id INTEGER,
    grade REAL,
    FOREIGN KEY(student_id) REFERENCES students(id),
    FOREIGN KEY(course_id) REFERENCES courses(id)
)''')

In [ ]:
# Insert sample data

cursor.executemany('INSERT INTO students (name, age, gender) VALUES (?, ?, ?)', [

('Alice', 22, 'F'),

('Bob', 20, 'M'),

('Charlie', 23, 'M')

])


cursor.executemany('INSERT INTO courses (name, credits) VALUES (?, ?)', [

('Math', 3),

('Science', 4),

('History', 2)

])


cursor.executemany('INSERT INTO enrollments (student_id, course_id, grade) VALUES (?, ?, ?)', [

(1, 1, 85),

(1, 2, 90),

(2, 1, 78),

(3, 3, 88)

])


conn.commit()

In [13]:
cursor.execute("select*from students")
print(cursor.fetchall())

[(1, 'Alice', 22, 'F'), (2, 'Bob', 20, 'M'), (3, 'Charlie', 23, 'M')]

In [14]:
cursor.execute("insert into students (name, age, gender) values  ('Deved',21,'M')")

In [16]:
cursor.execute("select*from students")
print(cursor.fetchall())
conn.commit()

[(1, 'Alice', 22, 'F'), (2, 'Bob', 20, 'M'), (3, 'Charlie', 23, 'M'), (4, 'Deved', 21, 'M')]

In [17]:
cursor.execute("select *from students  where age >21")
print(cursor.fetchall())

[(1, 'Alice', 22, 'F'), (3, 'Charlie', 23, 'M')]

In [18]:
cursor.execute('''SELECT s.name, e.grade

FROM students s

JOIN enrollments e ON s.id = e.student_id

WHERE e.grade BETWEEN 80 AND 90''')

print(cursor.fetchall())

[('Alice', 85.0), ('Alice', 90.0), ('Charlie', 88.0)]

In [19]:
# Total credits for each course

cursor.execute("SELECT name, credits FROM courses")

print(cursor.fetchall())

[('Math', 3), ('Science', 4), ('History', 2)]

In [20]:
# Students sorted by age descending

cursor.execute("SELECT * FROM students ORDER BY age DESC")

print(cursor.fetchall())

[(3, 'Charlie', 23, 'M'), (1, 'Alice', 22, 'F'), (4, 'Deved', 21, 'M'), (2, 'Bob', 20, 'M')]

In [23]:
# Students not enrolled in any courses (LEFT JOIN)

cursor.execute('''SELECT s.name

FROM students s
LEFT JOIN enrollments e ON s.id = e.student_id

WHERE e.id IS NULL''')

print(cursor.fetchall())

[('Deved',)]

In [24]:
cursor.execute('''
SELECT students.name, enrollments.grade
FROM students
JOIN enrollments ON students.id = enrollments.student_id
JOIN courses ON enrollments.course_id = courses.id
WHERE courses.name = "Math" AND enrollments.grade > 80
''')
result_math = cursor.fetchall()
print("Students enrolled in Math with grades above 80:", result_math)
cursor.execute('''
SELECT students.name, COUNT(enrollments.course_id) AS total_courses
FROM students
LEFT JOIN enrollments ON students.id = enrollments.student_id
GROUP BY students.id
''')
result_courses = cursor.fetchall()
print("Students and their total number of enrolled courses:", result_courses)

Students enrolled in Math with grades above 80: [('Alice', 85.0)]
Students and their total number of enrolled courses: [('Alice', 2), ('Bob', 1), ('Charlie', 1), ('Deved', 0)]